tests/performance/full_results/full_test.log
2026-05-13 12:29:24,697 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-13 12:29:24,718 INFO o.a.j.JMeter: Loading user properties from: D:\Tools\apache-jmeter-5.6.3\bin\user.properties
2026-05-13 12:29:24,718 INFO o.a.j.JMeter: Loading system properties from: D:\Tools\apache-jmeter-5.6.3\bin\system.properties
2026-05-13 12:29:24,727 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-13 12:29:24,727 INFO o.a.j.JMeter: Version 5.6.3
2026-05-13 12:29:24,727 INFO o.a.j.JMeter: java.version=1.8.0_181
2026-05-13 12:29:24,727 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-05-13 12:29:24,739 INFO o.a.j.JMeter: os.name=Windows 10
2026-05-13 12:29:24,739 INFO o.a.j.JMeter: os.arch=amd64
2026-05-13 12:29:24,739 INFO o.a.j.JMeter: os.version=10.0
2026-05-13 12:29:24,739 INFO o.a.j.JMeter: file.encoding=GBK
2026-05-13 12:29:24,739 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-13 12:29:24,739 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-13 12:29:24,739 INFO o.a.j.JMeter: Available Processors =8
2026-05-13 12:29:24,744 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-13 12:29:24,744 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-13 12:29:24,744 INFO o.a.j.JMeter: JMeterHome=D:\Tools\apache-jmeter-5.6.3
2026-05-13 12:29:24,744 INFO o.a.j.JMeter: user.dir  =D:\MUYU\browser-qa-agent
2026-05-13 12:29:24,744 INFO o.a.j.JMeter: PWD       =D:\MUYU\browser-qa-agent
2026-05-13 12:29:24,746 INFO o.a.j.JMeter: IP: 192.168.1.101 Name: LAPTOP-F63T0SVQ FullName: LAPTOP-F63T0SVQ
2026-05-13 12:29:24,766 INFO o.a.j.s.FileServer: Default base='D:\MUYU\browser-qa-agent'
2026-05-13 12:29:24,769 INFO o.a.j.s.FileServer: Set new base='D:\MUYU\browser-qa-agent\tests\performance'
2026-05-13 12:29:24,922 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-13 12:29:24,941 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-13 12:29:24,947 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-13 12:29:24,954 INFO o.a.j.s.SaveService: Loading file: D:\MUYU\browser-qa-agent\tests\performance\full_test.jmx
2026-05-13 12:29:25,028 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:29:25,028 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:29:25,028 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:29:25,028 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:29:25,028 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-13 12:29:25,028 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-13 12:29:25,402 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-13 12:29:25,410 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-13 12:29:25,411 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-13 12:29:25,411 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-13 12:29:25,417 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-13 12:29:25,417 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-13 12:29:25,866 INFO o.a.j.JMeter: Running test (1778646565866)
2026-05-13 12:29:25,928 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2026-05-13 12:29:25,928 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Thread Group.
2026-05-13 12:29:25,928 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-13 12:29:25,928 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-05-13 12:29:25,946 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-13 12:29:25,946 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-13 12:29:25,948 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2026-05-13 12:29:25,987 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-F63T0SVQ
2026-05-13 12:29:26,003 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-13 12:29:26,005 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-13 12:29:26,006 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-13 12:29:26,006 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-13 12:29:26,006 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-13 12:29:26,436 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2026-05-13 12:29:26,937 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2026-05-13 12:29:27,436 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-4
2026-05-13 12:29:27,937 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-5
2026-05-13 12:29:28,444 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-6
2026-05-13 12:29:28,944 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-7
2026-05-13 12:29:29,443 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-8
2026-05-13 12:29:29,941 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-9
2026-05-13 12:29:30,009 INFO o.a.j.r.Summariser: summary +    814 in 00:00:04 =  196.6/s Avg:    21 Min:     2 Max:   115 Err:     0 (0.00%) Active: 9 Started: 9 Finished: 0
2026-05-13 12:29:30,440 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-10
2026-05-13 12:29:55,938 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-3
2026-05-13 12:29:55,939 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2026-05-13 12:29:55,952 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-1
2026-05-13 12:29:55,952 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2026-05-13 12:29:55,966 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-4
2026-05-13 12:29:55,966 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-4
2026-05-13 12:29:55,987 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-10
2026-05-13 12:29:55,987 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-10
2026-05-13 12:29:55,994 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-7
2026-05-13 12:29:55,994 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-7
2026-05-13 12:29:56,004 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-9
2026-05-13 12:29:56,004 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-9
2026-05-13 12:29:56,021 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-5
2026-05-13 12:29:56,021 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-5
2026-05-13 12:29:56,028 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-8
2026-05-13 12:29:56,028 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-8
2026-05-13 12:29:56,036 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-2
2026-05-13 12:29:56,036 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2026-05-13 12:29:56,042 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-6
2026-05-13 12:29:56,042 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-6
2026-05-13 12:29:56,042 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-13 12:29:56,044 INFO o.a.j.r.Summariser: summary +   4884 in 00:00:26 =  187.6/s Avg:    53 Min:     1 Max:   402 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2026-05-13 12:29:56,044 INFO o.a.j.r.Summariser: summary =   5698 in 00:00:30 =  188.8/s Avg:    48 Min:     1 Max:   402 Err:     0 (0.00%)