tests/performance/results1/simple.log
2026-05-13 12:26:12,065 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-13 12:26:12,084 INFO o.a.j.JMeter: Loading user properties from: D:\Tools\apache-jmeter-5.6.3\bin\user.properties
2026-05-13 12:26:12,085 INFO o.a.j.JMeter: Loading system properties from: D:\Tools\apache-jmeter-5.6.3\bin\system.properties
2026-05-13 12:26:12,093 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-13 12:26:12,094 INFO o.a.j.JMeter: Version 5.6.3
2026-05-13 12:26:12,094 INFO o.a.j.JMeter: java.version=1.8.0_181
2026-05-13 12:26:12,094 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-05-13 12:26:12,094 INFO o.a.j.JMeter: os.name=Windows 10
2026-05-13 12:26:12,094 INFO o.a.j.JMeter: os.arch=amd64
2026-05-13 12:26:12,104 INFO o.a.j.JMeter: os.version=10.0
2026-05-13 12:26:12,105 INFO o.a.j.JMeter: file.encoding=GBK
2026-05-13 12:26:12,105 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-13 12:26:12,105 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-13 12:26:12,105 INFO o.a.j.JMeter: Available Processors =8
2026-05-13 12:26:12,110 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-13 12:26:12,111 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-13 12:26:12,111 INFO o.a.j.JMeter: JMeterHome=D:\Tools\apache-jmeter-5.6.3
2026-05-13 12:26:12,111 INFO o.a.j.JMeter: user.dir  =D:\MUYU\browser-qa-agent
2026-05-13 12:26:12,111 INFO o.a.j.JMeter: PWD       =D:\MUYU\browser-qa-agent
2026-05-13 12:26:12,113 INFO o.a.j.JMeter: IP: 192.168.1.101 Name: LAPTOP-F63T0SVQ FullName: LAPTOP-F63T0SVQ
2026-05-13 12:26:12,133 INFO o.a.j.s.FileServer: Default base='D:\MUYU\browser-qa-agent'
2026-05-13 12:26:12,136 INFO o.a.j.s.FileServer: Set new base='D:\MUYU\browser-qa-agent\tests\performance'
2026-05-13 12:26:12,278 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-13 12:26:12,293 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-13 12:26:12,299 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-13 12:26:12,307 INFO o.a.j.s.SaveService: Loading file: D:\MUYU\browser-qa-agent\tests\performance\simple.jmx
2026-05-13 12:26:12,377 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:26:12,377 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:26:12,377 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:26:12,378 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-13 12:26:12,378 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-13 12:26:12,378 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-13 12:26:12,765 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-13 12:26:12,772 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-13 12:26:12,773 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-13 12:26:12,773 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-13 12:26:12,781 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-13 12:26:12,781 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-13 12:26:13,221 INFO o.a.j.JMeter: Running test (1778646373221)
2026-05-13 12:26:13,275 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2026-05-13 12:26:13,275 INFO o.a.j.e.StandardJMeterEngine: Starting 2 threads for group Thread Group.
2026-05-13 12:26:13,275 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-13 12:26:13,275 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=2 ramp-up=1 delayedStart=false
2026-05-13 12:26:13,279 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-13 12:26:13,279 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-13 12:26:13,281 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2026-05-13 12:26:13,305 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-F63T0SVQ
2026-05-13 12:26:13,313 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-13 12:26:13,316 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-13 12:26:13,316 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-13 12:26:13,316 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-13 12:26:13,316 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-13 12:26:13,778 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2026-05-13 12:26:18,276 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-1
2026-05-13 12:26:18,276 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2026-05-13 12:26:18,279 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Thread Group 1-2
2026-05-13 12:26:18,280 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2026-05-13 12:26:18,280 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-13 12:26:18,282 INFO o.a.j.r.Summariser: summary =   3060 in 00:00:05 =  604.7/s Avg:     2 Min:     1 Max:    65 Err:     0 (0.00%)